MBronsom/OfflineSWD/Firmware/keil_standard_f103_20200910/RL/USB/Drivers/usbd_LPC177x_8x.c
/*----------------------------------------------------------------------------
 *      RL-ARM - USB
 *----------------------------------------------------------------------------
 *      Name:    usbd_LPC177x_8x.c
 *      Purpose: Hardware Layer module for NXP LPC177x/8x
 *      Rev.:    V4.70
 *----------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *---------------------------------------------------------------------------*/

#include <RTL.h>
#include <rl_usb.h>
#include "usbreg.h"
#include <LPC177x_8x.h>                      /* LPC177x_8x definitions        */

#define __NO_USB_LIB_C
#include "usb_config.c"

#pragma diag_suppress 1441

#define EP_MSK_CTRL 0x0001      /* Control Endpoint Logical Address Mask      */
#define EP_MSK_BULK 0xC924      /* Bulk Endpoint Logical Address Mask         */
#define EP_MSK_INT  0x2492      /* Interrupt Endpoint Logical Address Mask    */
#define EP_MSK_ISO  0x1248      /* Isochronous Endpoint Logical Address Mask  */

#ifdef __RTX
        BOOL        USBD_Int_Active = __FALSE;
static  OS_MUT      USBD_HW_Mutex;
#endif

#ifdef __RTX
#define TICK  10000
#else
static uint32_t calDelay = 0;
#endif

void USBD_Reset      (void);
void USBD_SetAddress (uint32_t adr, uint32_t setup);

/*
 *  Usb interrupt enable/disable
 *    Parameters:      ena: enable/disable
 *                       0: disable interrupt
 *                       1: enable interrupt
 */

#ifdef __RTX
void __svc(1) USBD_Intr (int ena);
void __SVC_1            (int ena) {
  if (ena) {
    NVIC_EnableIRQ(USB_IRQn);           /* Enable USB interrupt               */
  } else {
    NVIC_DisableIRQ(USB_IRQn);          /* Disable USB interrupt              */
  }
}
#endif


/*
 *  Get Endpoint Physical Address
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    Endpoint Physical Address
 */

static uint32_t EPAdr (uint32_t EPNum) {
  uint32_t val;

  val = (EPNum & 0x0F) << 1;
  if (EPNum & 0x80) {
    val += 1;
  }
  return (val);
}

/*
 *  usbd_delay_ms
 *    Parameter:  ms:         Number of milliseconds to delay execution for
 *    Return:
 */
void usbd_delay_ms (uint32_t ms) {
  
#ifdef __RTX
  float val = TICK / 1000;
  os_dly_wait ((uint16_t)((ms + val - 1.0) / val));
#else
  uint32_t cnt = 0, vals = 0, vale = 0;

start:
  if (!calDelay) {                      /* If not calibrated                  */
    cnt = 1000;
    if (!(SysTick->CTRL & SysTick_CTRL_ENABLE_Msk)) {
                                        /* If SysTick timer not running       */
      vals = 0xFFFFFF;
      SysTick->LOAD  = 0xFFFFFF;
      SysTick->VAL   = 0xFFFFFF;
      SysTick->CTRL  = SysTick_CTRL_CLKSOURCE_Msk | 
                       SysTick_CTRL_ENABLE_Msk;
    } else {
      vals = SysTick->VAL;              /* Timer start value                  */
    }
  } else {
    cnt = ms * calDelay;
  }

  while (cnt--);

  if (!calDelay) {                      /* If not calibrated                  */
    vale = SysTick->VAL;                /* Timer end value                    */
    if (vale >= vals)                   /* If timer reloaded                  */
      vals += SysTick->LOAD;
    SystemCoreClockUpdate();            /* Update SystemCoreClock variable    */
    calDelay = SystemCoreClock / (vals - vale);   /* Calibrated value         */
    if (vals == 0xFFFFFF)               /* Stop timer if we started it        */
      SysTick->CTRL  = 0;
    goto start;
  }
#endif
}

/*
 *  usbd_i2c_read
 *    Parameters:  i2c_adr:    Address of the I2C chip
 *                 reg_adr:    Address of the register to read
 *    Return:                  0 .. 0xFF = read value, -1 = error
 */

int usbd_i2c_read (uint8_t i2c_adr, uint8_t reg_adr) {
  int32_t tout;

  LPC_USB->I2C_TX    = (      1 << 8) | /* START bit on transmit start        */
                       (i2c_adr << 1) | /* I2C Address                        */
                       (      0 << 0) ; /* Write request                      */
  for (tout=1010; tout>=0; tout--) {    /* Wait for status, max 100 ms        */
    if (LPC_USB->I2C_STS & (1 << 11)) break;      /* Wait for Tx FIFO empty   */
    if (tout ==  0) return (-1);
    if (tout <= 10) usbd_delay_ms (10);
  }
  LPC_USB->I2C_TX    =  reg_adr;        /* Register address to read from      */
  for (tout=1010; tout>=0; tout--) {    /* Wait for status, max 100 ms        */
    if (LPC_USB->I2C_STS & (1 << 11)) break;      /* Wait for Tx FIFO empty   */
    if (tout ==  0) return (-1);
    if (tout <= 10) usbd_delay_ms (10);
  }
  LPC_USB->I2C_TX    = (      1 << 8) | /* START bit on transmit start        */
                       (i2c_adr << 1) | /* I2C Address                        */
                       (      1 << 0) ; /* Read request                       */
  LPC_USB->I2C_TX    = (      1 << 9) | /* STOP bit on end                    */
                        0x55;           /* Dummy data transmit to receive     */
  for (tout=1010; tout>=0; tout--) {    /* Wait for status, max 100 ms        */
    if (LPC_USB->I2C_STS & (1 << 0)) break;       /* Wait for transaction done*/
    if (tout ==  0) return (-1);
    if (tout <= 10) usbd_delay_ms (10);
  }
  for (tout=1010; tout>=0; tout--) {    /* Wait for status, max 100 ms        */
    if (!(LPC_USB->I2C_STS & (1 << 5))) break;    /* Wait for STOP condition  */
    if (tout ==  0) return (-1);
    if (tout <= 10) usbd_delay_ms (10);
  }
  return (LPC_USB->I2C_RX & 0xFF);
}


/*
 *  usbd_i2c_write
 *    Parameters:  i2c_adr:    Address of the I2C chip
 *                 reg_adr:    Address of the register to write
 *                 reg_val:    Value to be written
 *    Return:                 __TRUE = success, __FALSE = error
 */

int usbd_i2c_write (uint8_t i2c_adr, uint8_t reg_adr, uint8_t reg_val) {
  int32_t tout;

  LPC_USB->I2C_TX    = (      1 << 8) | /* START bit on transmit start        */
                       (i2c_adr << 1) | /* I2C Address                        */
                       (      0 << 0) ; /* Write request                      */
  for (tout=1010; tout>=0; tout--) {    /* Wait for status, max 100 ms        */
    if (LPC_USB->I2C_STS & (1 << 11)) break;      /* Wait for Tx FIFO empty   */
    if (tout ==  0) return (__FALSE);
    if (tout <= 10) usbd_delay_ms (10);
  }
  LPC_USB->I2C_TX    =  reg_adr;        /* Register address to write to       */
  for (tout=1010; tout>=0; tout--) {    /* Wait for status, max 100 ms        */
    if (LPC_USB->I2C_STS & (1 << 11)) break;      /* Wait for Tx FIFO empty   */
    if (tout ==  0) return (__FALSE);
    if (tout <= 10) usbd_delay_ms (10);
  }
  LPC_USB->I2C_TX    = (      1 << 9) | /* STOP bit on end                    */
                        reg_val;        /* Register value to write            */
  for (tout=1010; tout>=0; tout--) {    /* Wait for status, max 100 ms        */
    if (!(LPC_USB->I2C_STS & (1 << 5))) break;    /* Wait for STOP condition  */
    if (tout ==  0) return (__FALSE);
    if (tout <= 10) usbd_delay_ms (10);
  }
  return (__TRUE);
}


