MBronsom/OfflineSWD/Firmware/keil_standard_f103_20200910/RL/USB/Drivers/usbd_LPC177x_8x.c
/*
 *  Write Command
 *    Parameters:      cmd:   Command
 *    Return Value:    None
 */

static void WrCmd (uint32_t cmd) {

#ifdef __RTX
  if (!USBD_Int_Active) USBD_Intr(0);   /* Disable USB interrupt              */
#endif

  LPC_USB->DevIntClr = CCEMTY_INT;
  LPC_USB->CmdCode = cmd;
  while ((LPC_USB->DevIntSt & CCEMTY_INT) == 0);

#ifdef __RTX
  if (!USBD_Int_Active) USBD_Intr(1);   /* Enable USB interrupt               */
#endif
}


/*
 *  Write Command Data
 *    Parameters:      cmd:   Command
 *                     val:   Data
 *    Return Value:    None
 */

static void WrCmdDat (uint32_t cmd, uint32_t val) {

#ifdef __RTX
  if (!USBD_Int_Active) USBD_Intr(0);   /* Disable USB interrupt              */
#endif

  LPC_USB->DevIntClr = CCEMTY_INT;
  LPC_USB->CmdCode = cmd;
  while ((LPC_USB->DevIntSt & CCEMTY_INT) == 0);
  LPC_USB->DevIntClr = CCEMTY_INT;
  LPC_USB->CmdCode = val;
  while ((LPC_USB->DevIntSt & CCEMTY_INT) == 0);

#ifdef __RTX
  if (!USBD_Int_Active) USBD_Intr(1);   /* Enable USB interrupt               */
#endif
}


/*
 *  Write Command to Endpoint
 *    Parameters:      cmd:   Command
 *                     val:   Data
 *    Return Value:    None
 */

static void WrCmdEP (uint32_t EPNum, uint32_t cmd) {

#ifdef __RTX
  if (!USBD_Int_Active) USBD_Intr(0);   /* Disable USB interrupt              */
#endif

  LPC_USB->DevIntClr = CCEMTY_INT;
  LPC_USB->CmdCode = CMD_SEL_EP(EPAdr(EPNum));
  while ((LPC_USB->DevIntSt & CCEMTY_INT) == 0);
  LPC_USB->DevIntClr = CCEMTY_INT;
  LPC_USB->CmdCode = cmd;
  while ((LPC_USB->DevIntSt & CCEMTY_INT) == 0);

#ifdef __RTX
  if (!USBD_Int_Active) USBD_Intr(1);   /* Enable USB interrupt               */
#endif
}


/*
 *  Read Command Data
 *    Parameters:      cmd:   Command
 *    Return Value:    Data Value
 */

static uint32_t RdCmdDat (uint32_t cmd) {
  uint32_t USBCmdData;

#ifdef __RTX
  if (!USBD_Int_Active) USBD_Intr(0);   /* Disable USB interrupt              */
#endif

  LPC_USB->DevIntClr = CCEMTY_INT | CDFULL_INT;
  LPC_USB->CmdCode = cmd;
  while ((LPC_USB->DevIntSt & CDFULL_INT) == 0);
  USBCmdData = LPC_USB->CmdData; 

#ifdef __RTX
  if (!USBD_Int_Active) USBD_Intr(1);   /* Enable USB interrupt               */
#endif

  return (USBCmdData);
}


/*
 *  USB Device Initialize Function
 *   Called by the User to initialize USB Device
 *    Return Value:    None
 */

void USBD_Init (void) {

#ifdef __RTX
  os_mut_init(&USBD_HW_Mutex);
#endif

  LPC_SC->PCONP       |=  (1UL << 31);  /* Enable USB interface power/clock   */
  
  LPC_USB->USBClkCtrl = 0x1A;                  /* Dev, PortSel, AHB clock en  */
  while ((LPC_USB->USBClkSt & 0x1A) != 0x1A);
  
#ifdef USBD_2
  LPC_USB->StCtrl   =  0x02;            /* USB device maped to U2 port        */
  
  /* Set pin functions                                                        */
  LPC_IOCON->P1_30 = 2;
  LPC_IOCON->P0_14 = 3;                 /* USB_CONNECT2                       */
  LPC_IOCON->P0_31 = 1;                 /* USB_D+2                            */
                                        /* USB_D-2 is dedicated pin           */
  LPC_IOCON->P1_30 = 0;
  LPC_IOCON->P0_13 = 1 | (1 << 7);      /* USB_UP_LED2                        */

#else
  /* Enable USB1 Transceiver                                                  */
  LPC_USB->StCtrl   =  0x00;            /* USB device maped to U1 port        */
  LPC_USB->OTGClkCtrl =  0x1A;          /* Enable Device, OTG, AHB mster clk  */
  while (!((LPC_USB->OTGClkSt & 0x1A) == 0x1A));   /* Wait clock enable       */

  /* Enable pins                                                              */
  LPC_IOCON->P0_29 = 1;                 /* USB_D+1                            */
  LPC_IOCON->P0_30 = 1;                 /* USB_D-1                            */
  LPC_IOCON->P1_28 = 1;                 /* USB_SCL1                           */
  LPC_IOCON->P1_29 = 1;                 /* USB_SDA1                           */
  LPC_IOCON->P1_18 = 1;                 /* USB_UP_LED1                        */

  LPC_USB->OTGClkCtrl |= (1 << 2);      /* Enable I2C                         */
  while (!(LPC_USB->OTGClkSt & (1 << 2)));          /* Wait I2C clock enable  */

  LPC_USB->I2C_CTL   = 1 << 8;          /* I2C reset                          */
  while (LPC_USB->I2C_CTL & (1 << 8));  /* Wait reset end                     */

                                        /* Set I2C clock to 100kHz            */
  LPC_USB->I2C_CLKHI = 240;             /* 48MHz /200kHz = 240 clock cycles   */
  LPC_USB->I2C_CLKLO = 240;             /* 48MHz /200kHz = 240 clock cycles   */
#endif

  USBD_Reset();
  USBD_SetAddress(0, 0);

#ifdef __RTX
  USBD_Intr(1);                         /* enable USB interrupt               */
#else
  NVIC_EnableIRQ(USB_IRQn);             /* enable USB interrupt               */
#endif
}


/*
 *  USB Device Connect Function
 *   Called by the User to Connect/Disconnect USB Device
 *    Parameters:      con:   Connect/Disconnect
 *    Return Value:    None
 */

void USBD_Connect (BOOL con) {
  WrCmdDat(CMD_SET_DEV_STAT, DAT_WR_BYTE(con ? DEV_CON : 0));
  
#ifndef USBD_2
  switch (usbd_i2c_read (0x2D, 0x00) | (usbd_i2c_read (0x2D, 0x01) << 8)) {
    case 0x058D:                        /* MIC2555 Transceiver                */
      /* Control Register 2 = DP - Enable Pull-up                             */
      usbd_i2c_write (0x2D, 0x06, 0x01);
      break;
  }
#endif
}


/*
 *  USB Device Reset Function
 *   Called automatically on USB Device Reset
 *    Return Value:    None
 */

void USBD_Reset (void) {

  LPC_USB->EpInd     = 0;
  LPC_USB->MaxPSize  = USBD_MAX_PACKET0;
  LPC_USB->EpInd     = 1;
  LPC_USB->MaxPSize  = USBD_MAX_PACKET0;
  while ((LPC_USB->DevIntSt & EP_RLZED_INT) == 0);

  LPC_USB->EpIntClr  = 0xFFFFFFFF;
  LPC_USB->EpIntEn   = 0xFFFFFFFF;
  LPC_USB->DevIntClr = 0xFFFFFFFF;
  LPC_USB->DevIntEn  = DEV_STAT_INT    | EP_SLOW_INT    |
#ifdef __RTX
              ((USBD_RTX_DevTask   != 0) ? FRAME_INT : 0) |   /* SOF event    */
              ((USBD_RTX_DevTask   != 0) ? ERR_INT   : 0) ;   /* Error event  */
#else
              ((USBD_P_SOF_Event   != 0) ? FRAME_INT : 0) |   /* SOF event    */
              ((USBD_P_Error_Event != 0) ? ERR_INT   : 0) ;   /* Error event  */
#endif
}


